; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v1 - type_1 ?v5 - type_2)
 	      (pred_3 ?v8 - object ?v5 - type_2)
	      (pred_4 ?v1 - type_1 ?v6 - type_3)
	      (pred_2 ?v1 - type_1 ?v8 - object ?v6 - type_3))

   (:action op_1
       :parameters  (?v1 - type_1 ?v2 ?v4 - type_2)
       :precondition (and  (pred_1 ?v1 ?v2))
       :effect (and  (pred_1 ?v1 ?v4)
		     (not (pred_1 ?v1 ?v2))))

   (:action op_3
       :parameters (?v1 - type_1 ?v3 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v7) (pred_1 ?v1 ?v7) (pred_4 ?v1 ?v6))
       :effect (and (pred_2 ?v1 ?v3 ?v6)
		    (not (pred_3 ?v3 ?v7)) 
		    (not (pred_4 ?v1 ?v6))))

   (:action op_2
       :parameters (?v1 - type_1 ?v3 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v3 ?v6) (pred_1 ?v1 ?v7))
       :effect (and (pred_3 ?v3 ?v7)
		    (pred_4 ?v1 ?v6)
		    (not (pred_2 ?v1 ?v3 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_1
obj_10 obj_02 - type_3
obj_07 obj_04 obj_03 obj_09 - type_2
obj_06 obj_08 obj_05 - object)
(:init
(pred_1 obj_01 obj_09)
(pred_4 obj_01 obj_10)
(pred_4 obj_01 obj_02)
(pred_3 obj_06 obj_03)
(pred_3 obj_08 obj_04)
(pred_3 obj_05 obj_09)
)
(:goal
(and
(pred_3 obj_06 obj_04)
(pred_3 obj_08 obj_04)
(pred_3 obj_05 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_01 ?b obj_02))))
)
)

; plan
1. (op_3 obj_01 obj_05 obj_09 obj_10)
   deleted: (pred_3 obj_05 obj_09) (pred_4 obj_01 obj_10)
   added: (pred_2 obj_01 obj_05 obj_10)
   goals met: 1 of 3
2. (op_1 obj_01 obj_09 obj_07)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_07)
   goals met: 1 of 3
3. (op_2 obj_01 obj_05 obj_07 obj_10)
   deleted: (pred_2 obj_01 obj_05 obj_10)
   added: (pred_3 obj_05 obj_07) (pred_4 obj_01 obj_10)
   goals met: 2 of 3
4. (op_1 obj_01 obj_07 obj_03)
   deleted: (pred_1 obj_01 obj_07)
   added: (pred_1 obj_01 obj_03)
   goals met: 2 of 3
5. (op_3 obj_01 obj_06 obj_03 obj_10)
   deleted: (pred_3 obj_06 obj_03) (pred_4 obj_01 obj_10)
   added: (pred_2 obj_01 obj_06 obj_10)
   goals met: 2 of 3
6. (op_1 obj_01 obj_03 obj_04)
   deleted: (pred_1 obj_01 obj_03)
   added: (pred_1 obj_01 obj_04)
   goals met: 2 of 3
7. (op_2 obj_01 obj_06 obj_04 obj_10)
   deleted: (pred_2 obj_01 obj_06 obj_10)
   added: (pred_3 obj_06 obj_04) (pred_4 obj_01 obj_10)
   goals met: 3 of 3
